app/views/clubs/_form.html.erb

SELECT "players"."name", "players"."id" FROM "players"
---
  <div class="form-group">
  <%= f.select :player_id, Player.pluck(:name, :id), :include_blank => true, :class => 'form-control' %>