app/views/players/_form.html.erb

  <div class="form-group">
  <%= f.select :club_id, Club.pluck(:team_name, :id), :include_blank => true, :class => 'form-control' %>
---
SELECT "clubs"."team_name", "clubs"."id" FROM "clubs"