app/controllers/clubs_controller.rb

  def index
    @clubs = if params[:sort_by] == "team_name"
      Club.order(:team_name)
---
SELECT "clubs".* FROM "clubs" ORDER BY "clubs"."team_name" ASC