app/controllers/players_controller.rb

  def index
    @players = if params[:sort_by] == "name"
      Player.order(:name)
---
SELECT "players".* FROM "players" ORDER BY "players"."name" ASC